app/controllers/items_controller.rb

  def search
    @items = Item.paginate( :all,
                            :conditions => ["MATCH (name, description, shop_state, shop_suburb) AGAINST (? IN BOOLEAN MODE)", '+' + params[:term] ],
                            :page => params[:page],
                            :per_page => 10,
                            :order => 'created_at DESC' )
---
SELECT * FROM `items` WHERE (`items`.`name` = 'desc') LIMIT 1