app/controllers/items_controller.rb

  def index
    @search = Item.search(params[:search])
---
SELECT * FROM `items`

  def search
    @q = Item.search(params[:q])
    @items = @q.result.paginate(:page => params[:page], :per_page => 10, :order => 'created_at DESC' )
---
SELECT * FROM `items` WHERE (CONCAT(name,' ',description) LIKE '%desc%')
SELECT * FROM `items` WHERE (MATCH (name, description, shop_state, shop_suburb) AGAINST ('+Leichardt' IN BOOLEAN MODE)) ORDER BY created_at DESC LIMIT 0, 10
SELECT count(*) AS count_all FROM `items` WHERE (MATCH (name, description, shop_state, shop_suburb) AGAINST ('+Leichardt' IN BOOLEAN MODE))

  def show
    @item = Item.find(params[:id])
---
SELECT * FROM `items` WHERE (`items`.`id` = 1)

  def create
    @item = Item.new(params[:item])
    @item.seller = current_user
    @item.submitter = current_user

    respond_to do |format|
      if @item.save
---
INSERT INTO `items` (`name`, `updated_at`, `price`, `url`, `description`, `created_at`) VALUES('name 1', '2009-09-07 07:46:34', 10, 'url 1', 'description 1', '2009-09-07 07:46:34')